const PROVINCES = [
  "北京",
  "河北省",
  "天津",
  "山西省",
]
const CITYS = [
  ["北京市"],
  ["石家庄市", "邯郸市", "唐山市", "秦皇岛市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市"],
  ["天津市"],
  ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"],
]
const REGIONS = [
  [
    ["西城区", "朝阳区", "海淀区", "丰台区", "石景山区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"]
  ],
  [
    ["长安区", "桥东区", "桥西区", "新华区", "井陉矿区", "裕华区", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市", "井陉县", "正定县", "栾城县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县"],
    ["丛台区", "邯山区", "复兴区", "峰峰矿区", "武安市", "邯郸县", "临漳县", "成安县", "大名县", "涉县", "磁县", "肥乡县", "永年县", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县", "曲周县"],
    ["路北区", "路南区", "古冶区", "开平区", "丰南区", "丰润区", "遵化市", "迁安区", "滦县", "滦南县", "乐亭县", "迁西县", "玉田县", "唐海县"],
    ["海港区", "山海关区", "北戴河区", "昌黎县", "抚宁县", "卢龙县", "青龙满族自治县"],
    ["桥东区", "桥西区", "南宫市", "沙河市", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任县", "南和县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县"],
    ["新市区", "北市区", "南市区", "涿州市", "定州市", "安国市", "高碑店市", "满城县", "清苑县", "涞水县", "阜平县", "徐水县", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县"],
    ["双桥区", "双滦区", "鹰手营", "子矿区", "承德县", "兴隆县", "平泉县", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县"],
    ["运河区", "新华区", "泊头市", "任丘市", "黄骅市", "河间市", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县"],
    ["安次区", "广阳区", "霸州市", "三河市", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县"],
    ["桃城区", "冀州市", "深州市", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景县", "阜城县"]
  ],
  [
    ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "滨海新区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河区", "静海区", "蓟州区"],
  ],
  [
    ["杏花岭区", "小店区", "迎泽区", "尖草坪区", "万柏林区", "晋源区", "古交市", "清徐县", "阳曲县", "娄烦县"],
    ["城区", "矿区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "大同县"],
    ["城区", "矿区", "郊区", "平定县", "盂县"],
    ["城区", "郊区", "潞城市", "长治县", "襄垣县", "屯留县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县"],
    ["城区", "泽州县", "高平市", "阳城县", "陵川县", "沁水县"],
    ["朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁县"],
    ["榆次区", "介休市", "太谷县", "祁县", "平遥县", "灵石县", "寿阳县", "昔阳县", "顺县", "左权县", "榆社县"],
    ["盐湖区", "空港新区", "永济市", "河津市", "芮城县", "临猗县", "万荣县", "新绛县", "稷山县", "闻喜县", "夏县", "绛县", "平陆县", "垣曲县"],
    ["忻府区", "原平市", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县"],
    ["尧都区", "侯马市", "霍州市", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "蒲县", "大宁县", "永和县", "隰县", "汾西县"],
    ["离石区", "孝义市", "汾阳市", "文水县", "中阳县", "兴县", "临县", "方山县", "柳林县", "岚县", "交口县", "交城县", "石楼县"]
  ]
]
const PICKER = {
  TITLE: ["省", "市", "区"],
  P: "P",
  C: "C",
  R: "R",
  ZERO: "0",
  MOUSEDOWN:'mousedown',
  PROVINCES,
  CITYS,
  REGIONS
};

const PREVIEW = [
  {
    thumbnailUrl:'https://tse2-mm.cn.bing.net/th/id/OIP-C.xsA-3qUw6cqmd8nRfxk6TQHaEK?w=290&h=180&c=7&r=0&o=5&dpr=2&pid=1.7',
    previewUrl:'https://tse2-mm.cn.bing.net/th/id/OIP-C.xsA-3qUw6cqmd8nRfxk6TQHaEK?w=290&h=180&c=7&r=0&o=5&dpr=2&pid=1.7'
  },
  {
    thumbnailUrl:'https://tse1-mm.cn.bing.net/th/id/OIP-C.mcF6ZHB4Iu0HGqc7D0H9AgHaEK?w=290&h=180&c=7&r=0&o=5&dpr=2&pid=1.7',
    previewUrl:'https://tse1-mm.cn.bing.net/th/id/OIP-C.mcF6ZHB4Iu0HGqc7D0H9AgHaEK?w=290&h=180&c=7&r=0&o=5&dpr=2&pid=1.7'
  },
  {
    thumbnailUrl:'https://tse3-mm.cn.bing.net/th/id/OIP-C.Ay9IpllqRw8Nz4HgTwe4AgHaEo?w=298&h=183&c=7&r=0&o=5&dpr=2&pid=1.7',
    previewUrl:'https://tse3-mm.cn.bing.net/th/id/OIP-C.Ay9IpllqRw8Nz4HgTwe4AgHaEo?w=298&h=183&c=7&r=0&o=5&dpr=2&pid=1.7'
  },
  {
    thumbnailUrl:'https://tse4-mm.cn.bing.net/th/id/OIP-C.kB-Ovasi0GW67-rmwnAcwAHaEo?w=282&h=180&c=7&r=0&o=5&dpr=2&pid=1.7',
    previewUrl:'https://tse4-mm.cn.bing.net/th/id/OIP-C.kB-Ovasi0GW67-rmwnAcwAHaEo?w=282&h=180&c=7&r=0&o=5&dpr=2&pid=1.7'
  },
  {
    thumbnailUrl:'https://tse4-mm.cn.bing.net/th/id/OIP-C.i0-ND27ia6sO-nZuY9f7qAHaEK?w=286&h=180&c=7&r=0&o=5&dpr=2&pid=1.7',
    previewUrl:'https://tse4-mm.cn.bing.net/th/id/OIP-C.i0-ND27ia6sO-nZuY9f7qAHaEK?w=286&h=180&c=7&r=0&o=5&dpr=2&pid=1.7'
  },
]

const Colors = [
  "primary",
  "success",
  "danger",
  "warning",
  "weak",
  "white",
  "black",
  "title",
  "border",
  "body",
  "division",
];
export {
  PICKER,
  PREVIEW,
  Colors
}